			#+TITLE: My TODO file
* DONE 1-8 math homework handout                           :school:homework:
  SCHEDULED: <2021-01-28 Thu 20:30-21:15> DEADLINE: <2021-01-28 Thu> ENTERED [2021-01-28 Thu 10:55]
  :PROPERTIES:
  :EFFORT: 0:45
  :END:
:LOGBOOK:
CLOCK: [2021-01-28 Thu 20:56]--[2021-01-28 Thu 21:27] =>  0:31
:END:
* DONE vhl homework in vhl                                 :school:homework:
  DEADLINE: <2021-01-27 Wed> ENTERED [2021-01-27 Wed 12:26]
  :PROPERTIES:
  :EFFORT: 0:30
  :ID:       012ffacc-b8b1-4760-ae97-d560dec5cfd6
  :END:
:LOGBOOK:
CLOCK: [2021-01-27 Wed 20:44]--[2021-01-27 Wed 21:14] =>  0:30
CLOCK: [2021-01-27 Wed 19:33]--[2021-01-27 Wed 19:43] =>  0:10
:END:
* DONE primary source document for history                 :school:homework:
  SCHEDULED: <2021-01-26 Tue 20:15-20:45> DEADLINE: <2021-01-26 Tue> ENTERED [2021-01-26 Tue 11:55]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
:LOGBOOK:
CLOCK: [2021-01-27 Wed 19:17]--[2021-01-27 Wed 19:33] =>  0:16
:END:
* DONE finish reading OMM chp 3 and do discussion prep sheet :school:homework:
  SCHEDULED: <2021-01-26 Tue 19:15-20:15> DEADLINE: <2021-01-26 Tue> ENTERED [2021-01-26 Tue 11:38]
  :PROPERTIES:
  :EFFORT: 1:00
  :END:
:LOGBOOK:
CLOCK: [2021-01-26 Tue 20:26]--[2021-01-26 Tue 21:26] =>  1:00
:END:
* DONE [#A] finish spanish homework from todays page in onenote :school:homework:
  DEADLINE: <2021-01-25 Mon> ENTERED [2021-01-25 Mon 13:45]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
:LOGBOOK:
CLOCK: [2021-01-25 Mon 20:20]--[2021-01-25 Mon 20:30] =>  0:10
:END:
* DONE [#B] history homework in onenote                    :school:homework:
  DEADLINE: <2021-01-25 Mon> ENTERED [2021-01-25 Mon 11:54]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
:LOGBOOK:
CLOCK: [2021-01-25 Mon 18:19]--[2021-01-25 Mon 20:15] =>  1:56
:END:
* DONE math homework in onenote                            :school:homework:
  DEADLINE: <2021-01-21 Thu> ENTERED [2021-01-21 Thu 17:34]
  :PROPERTIES:
  :EFFORT: 0:45
  :END:
:LOGBOOK:
CLOCK: [2021-01-21 Thu 19:44]--[2021-01-21 Thu 21:00] =>  1:16
:END:
* DONE study percent composition                           :school:homework:
  DEADLINE: <2021-01-21 Thu> ENTERED [2021-01-21 Thu 17:34]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
:LOGBOOK:
CLOCK: [2021-01-21 Thu 21:00]--[2021-01-21 Thu 21:30] =>  0:30
:END:
* DONE finish cs/n workshet                                :school:homework:
  DEADLINE: <2021-01-19 Tue> ENTERED [2021-01-19 Tue 10:12]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
:LOGBOOK:
CLOCK: [2021-01-19 Tue 17:14]--[2021-01-19 Tue 17:37] =>  0:23
:END:
* DONE cs/n worksheets in onenote                          :school:homework:
  DEADLINE: <2021-01-13 Wed> ENTERED [2021-01-13 Wed 17:58]
  :PROPERTIES:
  :EFFORT: 0:45
  :END:
:LOGBOOK:
CLOCK: [2021-01-13 Wed 19:31]--[2021-01-13 Wed 20:31] =>  1:00
:END:
* DONE spanish vhl links                                   :school:homework:
  DEADLINE: <2021-01-13 Wed> ENTERED [2021-01-13 Wed 17:57]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
:LOGBOOK:
CLOCK: [2021-01-13 Wed 18:08]--[2021-01-13 Wed 19:23] =>  1:15
:END:
* DONE Math homework page 356 txtbook                      :school:homework:
  SCHEDULED: <2021-01-06 Wed 19:30-20:15> DEADLINE: <2021-01-06 Wed> ENTERED [2021-01-06 Wed 13:53]
  :PROPERTIES:
  :EFFORT: 0:45
  :END:
  :LOGBOOK:
  CLOCK: [2021-01-06 Wed 19:48]--[2021-01-06 Wed 20:26] =>  0:38
  :END:
  Problem numbers 17 20 22 23 25 26 30 35-37
* DONE English nearpod assignment                          :school:homework:
  DEADLINE: <2021-01-08 Fri> ENTERED [2021-01-06 Wed 08:09]
  :PROPERTIES:
  :Effort:   1:00
  :END:
  :LOGBOOK:
  CLOCK: [2021-01-06 Wed 18:34]--[2021-01-06 Wed 19:02] =>  0:28
  CLOCK: [2021-01-06 Wed 08:10]--[2021-01-06 Wed 08:41] =>  0:31
  CLOCK: [2021-01-06 Wed 08:10]--[2021-01-06 Wed 08:10] =>  0:00
  CLOCK: [2021-01-06 Wed 08:10]--[2021-01-06 Wed 08:10] =>  0:00
  :END:
[[https://share.nearpod.com/YXLQDszaMcb][Link]]
* DONE email dr. chu about other credit things                :email:school:
  DEADLINE: <2021-01-05 Tue>  ENTERED: [2021-01-05 Tue 15:02]
  :LOGBOOK:
  CLOCK: [2021-01-06 Wed 08:10]--[2021-01-06 Wed 08:10] =>  0:00
  :END:
* DONE cs/n ip address shit worksheet                      :school:homework:
  DEADLINE: <2021-01-06 Wed> ENTERED [2021-01-05 Tue 09:10]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
  :LOGBOOK:
  CLOCK: [2021-01-06 Wed 08:10]--[2021-01-06 Wed 08:10] =>  0:00
  CLOCK: [2021-01-06 Wed 08:10]--[2021-01-06 Wed 08:10] =>  0:00
  :END:
* DONE finish the omm discussion sheet                      :school:homework:
  SCHEDULED: <2021-01-04 Mon 18:00-18:30> DEADLINE: <2021-01-04 Mon> ENTERED [2021-01-04 Mon 10:30]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
  :LOGBOOK:
  CLOCK: [2021-01-04 Mon 18:01]--[2021-01-04 Mon 18:37] =>  0:36
  CLOCK: [2021-01-04 Mon 10:37]--[2021-01-04 Mon 10:37] =>  0:00
  CLOCK: [2021-01-04 Mon 10:36]--[2021-01-04 Mon 10:37] =>  0:01
  :END:
  - Link: [[file:~/Documents/School/Apocalypse-2021_School_Year/English/Of Mice and Men Pre.odt][Document]]
* DONE study osi layers and stuff for csn                   :school:homework:
  CLOSED: [2020-12-21 Mon 19:49] DEADLINE: <2020-12-21 Mon> ENTERED [2020-12-20 Sun 17:56]
  :PROPERTIES:
  :EFFORT: 0:30
  :END:
  :LOGBOOK:
  CLOCK: [2020-12-21 Mon 19:09]--[2020-12-21 Mon 19:11] =>  0:02
  :END:
* DONE study for history quiz                               :school:homework:
  CLOSED: [2020-12-21 Mon 21:21] DEADLINE: <2020-12-21 Mon> ENTERED [2020-12-19 Sat 17:14]
  :PROPERTIES:
  :EFFORT: 0:35
  :END:
  :LOGBOOK:
  CLOCK: [2020-12-21 Mon 19:11]--[2020-12-21 Mon 19:49] =>  0:38
  :END:
